In [3]:
%matplotlib inline
import pandas as pd

In [4]:
cast = pd.read_csv('cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [5]:
cast['title'].count()

3611206

In [44]:
cast.count()

title        3611206
year         3611212
name         3611212
type         3611212
character    3611198
n            2231970
dtype: int64

### What are the earliest two films listed in the titles dataframe?

In [8]:
cast['title'].head(2)

0     Closet Monster
1    Suuri illusioni
Name: title, dtype: object

### How many movies have the title "Hamlet"?

In [117]:
count1 = cast['title'].value_counts()['Hamlet']

In [116]:
cast[cast['title'] == 'Hamlet']['title'].count()

313

In [118]:
print("""The number of movies having "Hamlet" as a title : """,count1)

The number of movies having "Hamlet" as a title :  313

### How many movies are titled "North by Northwest"?

In [16]:
count2 = cast['title'].value_counts()['North by Northwest']

In [17]:
print("""The number of movies having "North by Northwest" as a title : """,count2)

The number of movies having "North by Northwest" as a title :  112

### When was the first movie titled "Hamlet" made?

In [28]:
first_record = cast[cast['title'] == 'Hamlet']['year'].iloc[0]

In [31]:
print("First movie for the title Hamlet made in the year : ", first_record)

First movie for the title Hamlet made in the year :  1996

### List all of the "Treasure Island" movies from earliest to most recent.

In [34]:
cast[cast['title'] =='Treasure Island'].sort_values('year')

,title,year,name,type,character,n
830114,Treasure Island,1918,Charles Gorman,actor,Prologue Player,NaN
840745,Treasure Island,1918,Joe Grant,actor,Undetermined child role,NaN
909157,Treasure Island,1918,Edwin Harley,actor,Prologue Player,NaN
3298306,Treasure Island,1918,Violet Radcliffe,actress,Long John Silver,3.0
1715014,Treasure Island,1918,Lloyd Perl,actor,Black Dog,4.0
...,...,...,...,...,...,...
2420089,Treasure Island,1999,Caveh Zahedi,actor,Harold,9.0
1637661,Treasure Island,1999,Nick Offerman,actor,Samuel,2.0
1375015,Treasure Island,1999,J.P. Manoux,actor,Officer Hughes,18.0
1797264,Treasure Island,1999,Victor Raider-Wexler,actor,Samowitz,10.0
307749,Treasure Island,1999,Bob Byington,actor,Thomas,12.0

### How many movies were made in the year 1950?

In [50]:
num1 = cast[cast['year']== 1950]['title'].count()

In [51]:
print("The number of movies made in the year 1950 :", num1)

The number of movies made in the year 1950 : 22006

### How many movies were made in the year 1960?

In [56]:
num2 = cast[cast['year']== 1960]['title'].count()

In [57]:
print("The number of movies made in the year 1960 :", num2)

The number of movies made in the year 1960 : 18456

### How many movies were made from 1950 through 1959?

In [63]:
n1 = cast[(cast['year']>=1950) & (cast['year']<=1959)]['title'].count()

In [61]:
print("The number of movies made from 1950 through 1959 is : ",n1)

The number of movies made from 1950 through 1959 is :  210986

### In what years has a movie titled "Batman" been released?

In [67]:
cast[cast['title'] == 'Batman'][['title','year']]

          title  year
95672    Batman  1943
96186    Batman  1943
114034   Batman  1989
119476   Batman  1989
149767   Batman  1989
...         ...   ...
2907449  Batman  1989
3253550  Batman  1943
3343947  Batman  1989
3345872  Batman  1989
3356826  Batman  1989

[120 rows x 2 columns]

### How many roles were there in the movie "Inception"?

In [88]:
cast[cast['title'] == 'Inception']['character'].count()

77

In [73]:
cast[cast['title'] == 'Inception'][['character','n']].head()

                    character     n
94333           LAX Passenger   NaN
143138  Fischer's Jet Captain  44.0
176819               Browning   8.0
190249       Mombasan Gambler   NaN
250191         Bridge Sub Con  29.0

In [ ]:
### I did not get this above question, please help me with this sir

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [102]:
cast[(cast['title'] == 'Inception') & (cast['n'].isna())][['character','n']]

                         character   n
94333                LAX Passenger NaN
190249            Mombasan Gambler NaN
361119               LAX Passenger NaN
659835             Italian Gambler NaN
666157                Stock Broker NaN
682511                       Extra NaN
806524              Bridge Sub Con NaN
971196                  Pedestrian NaN
1056651                Hotel Guest NaN
1069724      Japanese Landing Crew NaN
1080743      Mombasan Casino Staff NaN
1146809     Mombasa Casino Cashier NaN
1203175  Saito's Bodyguard Officer NaN
1249439              Street Person NaN
1264919             French Student NaN
1606290                A Passer-By NaN
1770685                 Pedestrian NaN
1852069             Bridge Sub Con NaN
1927805             Airport Patron NaN
2050419             Airport Patron NaN
2156986                    Denison NaN
2686796           Mombasan Cashier NaN
2739039                Stockbroker NaN
2831371              LAX Passenger NaN
2928772                   Reporter NaN
3016734             Airport Patron NaN

In [104]:
n2 = cast[(cast['title'] == 'Inception') & (cast['n'].isna())]['character'].count()
print("The number of roles in the movie 'Inception' are NOT ranked by an 'n' value is : ", n2)

The number of roles in the movie 'Inception' are NOT ranked by an 'n' value is :  26

### But how many roles in the movie "Inception" did receive an "n" value?

In [105]:
n3 = cast[(cast['title'] == 'Inception') & (cast['n'].notnull())]['character'].count()
print("The number of roles in the movie 'Inception' are ranked by an 'n' value is : ", n3)

The number of roles in the movie 'Inception' are ranked by an 'n' value is :  51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [127]:
n = cast[(cast['title'] == 'North by Northwest') & (cast['n'].notnull())][['character','n']]

In [129]:
n.count()

character    16
n            16
dtype: int64

In [128]:
n.sort_values('n')

                           character     n
840374            Roger O. Thornhill   1.0
3361396                  Eve Kendall   2.0
1404704              Phillip Vandamm   3.0
3024085              Clara Thornhill   4.0
343701                 The Professor   5.0
2923056                Mrs. Townsend   6.0
1634552              Lester Townsend   7.0
1229083                      Leonard   8.0
2357939                     Valerian   9.0
1746383              Victor Larrabee  10.0
642085                         Licht  11.0
2212083                   Auctioneer  12.0
447893                     Dr. Cross  13.0
1454363               Sergeant Flamm  14.0
198496                Captain Junket  15.0
1334726  Charley - Chicago Policeman  16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [132]:
cast[(cast['title'] == 'Sleuth') & (cast['n'].notnull()) & (cast['year']== 1972)][['title','year','character','n']]

          title  year                   character    n
314691   Sleuth  1972                 Milo Tindle  2.0
360365   Sleuth  1972           Inspector Doppler  3.0
1396572  Sleuth  1972      Police Constable Higgs  6.0
1412647  Sleuth  1972  Detective Sergeant Tarrant  4.0
1644328  Sleuth  1972                 Andrew Wyke  1.0
2619278  Sleuth  1972             Marguerite Wyke  5.0

In [138]:
nd = cast[(cast['title'] == 'Sleuth') & (cast['n'].notnull()) & (cast['year']== 1972)][['character','n']]

In [139]:
nd['character'].count()

6

In [140]:
nd.sort_values('n')

                          character    n
1644328                 Andrew Wyke  1.0
314691                  Milo Tindle  2.0
360365            Inspector Doppler  3.0
1412647  Detective Sergeant Tarrant  4.0
2619278             Marguerite Wyke  5.0
1396572      Police Constable Higgs  6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [143]:
cast[(cast['title'] == 'Sleuth') & (cast['n'].notnull()) & (cast['year']== 2007)][['title','year','character','n']]

          title  year    character    n
314692   Sleuth  2007       Andrew  1.0
1246855  Sleuth  2007         Milo  2.0
1741124  Sleuth  2007  Man on T.V.  3.0

In [144]:
ns = cast[(cast['title'] == 'Sleuth') & (cast['n'].notnull()) & (cast['year']== 2007)][['character','n']]

In [145]:
ns.sort_values('n')

           character    n
314692        Andrew  1.0
1246855         Milo  2.0
1741124  Man on T.V.  3.0

### How many roles were credited in the silent 1921 version of Hamlet?

In [ ]:
### can you please mention what do you mean by 'credited'

In [148]:
cast[(cast['title'] == 'Hamlet') & (cast['year'] == 1921)]

          title  year                    name     type         character    n
7438     Hamlet  1921        Fritz Achterberg    actor       Fortinbras,  9.0
442224   Hamlet  1921            Paul Conradi    actor      K?nig Hamlet  2.0
535307   Hamlet  1921        Anton De Verdier    actor           Laertes  7.0
1095274  Hamlet  1921         Hans Junkermann    actor          Polonius  6.0
2106367  Hamlet  1921            Heinz Stieda    actor           Horatio  5.0
2289163  Hamlet  1921  Eduard von Winterstein    actor          Claudius  4.0
2562876  Hamlet  1921         Mathilde Brandt  actress  K?nigin Gertrude  3.0
2935728  Hamlet  1921          Lilly Jacobson  actress           Ophelia  8.0
3209199  Hamlet  1921            Asta Nielsen  actress            Hamlet  1.0

In [149]:
s1 = cast[(cast['title'] == 'Hamlet') & (cast['year'] == 1921)]['character']

In [150]:
s1.count()

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [154]:
cast[(cast['title'] == 'Hamlet') & (cast['year'] == 1996) & (cast['name'] == 'Kenneth Branagh')][['character']]

       character
250281    Hamlet

In [157]:
s2 = cast[(cast['title'] == 'Hamlet') & (cast['year'] == 1996) & (cast['name'] == 'Kenneth Branagh')]['character']

In [158]:
s2.count()

1

### How many "Hamlet" roles have been listed in all film credits through history?

In [ ]:
### NOt sure with this question what we are supposed to print

In [121]:
cast[cast['character'] == 'Hamlet']['character'].count()

91

In [122]:
cast[(cast['character'] == 'Hamlet') & (cast['title'] == 'Hamlet')][['title','character']]

          title character
250281   Hamlet    Hamlet
301167   Hamlet    Hamlet
720239   Hamlet    Hamlet
797167   Hamlet    Hamlet
927474   Hamlet    Hamlet
1445165  Hamlet    Hamlet
1464220  Hamlet    Hamlet
1475484  Hamlet    Hamlet
1476221  Hamlet    Hamlet
1545289  Hamlet    Hamlet
1592118  Hamlet    Hamlet
1804123  Hamlet    Hamlet
2365616  Hamlet    Hamlet
3209199  Hamlet    Hamlet
3256505  Hamlet    Hamlet

### How many people have played an "Ophelia"?

In [113]:
ophelia = cast[cast['character'] == 'Ophelia']['name'].count()

In [114]:
print("The number of people have played a role called 'Ophelia' is:",ophelia)

The number of people have played a role called 'Ophelia' is: 111

### How many people have played a role called "The Dude"?

In [110]:
Dude = cast[cast['character'] == 'The Dude']['name'].count()

In [111]:
print("The number of people have played a role called 'The Dude' is:",Dude)

The number of people have played a role called 'The Dude' is: 18

### How many people have played a role called "The Stranger"?

In [106]:
stranger = cast[cast['character'] == 'The Stranger']['name'].count()

In [107]:
print("The number of people have played a role called 'The Stranger' is:",stranger)

The number of people have played a role called 'The Stranger' is: 208

### How many roles has Sidney Poitier played throughout his career?

In [164]:
c = cast[cast['name'] == 'Sidney Poitier']['character'].count()

In [165]:
print("The number of roles has Sidney Poitier played throughout his career is :",c)

The number of roles has Sidney Poitier played throughout his career is : 43

### How many roles has Judi Dench played?

In [166]:
c1 = cast[cast['name'] == 'Judi Dench']['character'].count()

In [167]:
print("The number of roles has Judi Dench played throughout his career is :",c1)

The number of roles has Judi Dench played throughout his career is : 55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [169]:
c2 = cast[(cast['name'] == 'Cary Grant') & (cast['year'] == 1940) & (cast['n']==2)]

In [170]:
c2.sort_values('year')

                   title  year        name   type character    n
840371  My Favorite Wife  1940  Cary Grant  actor      Nick  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [ ]:
### Did not get how to seggregate supporting role and leading role sir

### How many roles were available for actors in the 1950s?

In [172]:
r1 = cast[(cast['type'] == 'actor') & (cast['year'] == 1950)]['character']

In [173]:
r1.count()

16512

### How many roles were available for actresses in the 1950s?

In [174]:
r2 = cast[(cast['type'] == 'actress') & (cast['year'] == 1950)]['character']

In [175]:
r2.count()

5494

### How many leading roles (n=1) were available from the beginning of film history through 1980?

### How many non-leading roles were available through from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?